<template>
  <div class="wrapper">
    <ks-header />
    <ks-heading-bio />
    <div class="ks-bio__col">
      <ks-bio-chapter title="Детство" timeline="1983 - 1995 гг.">
        <p class="ks-bio__bblock-text">
          Я родился и вырос в Восточном округе Москвы. Мои дедушка с бабушкой приехали в столицу в военный период:
          бабушка как боец ополчения, дедушка в качестве разнорабочего. Позже у них родилась моя мама.
          <br />
          <br />
          Семья, в которой я рос, была среднестатистической семьёй пролетариев. Отца я никогда не видел, только
          разговаривал с ним один раз по телефону, в возрасте пяти лет.  Мама часто была на работе, поэтому я рос с
          бабушкой, женщиной строгих правил. Благодаря её воспитанию 90-ые для меня прошли относительно спокойно.
          <br />
          <br />
          В школе я не был популярным. Мне было сложно общаться с остальными ребятами, тяжело находить с ними общий
          язык.
        </p>
      </ks-bio-chapter>
      <ks-bio-photo img-url="block-1.jpg" alt="Группа Алексея в дестском саду" />
    </div>
    <div class="ks-bio__col">
      <ks-bio-chapter title="Юность" timeline="1995 - 2000 гг.">
        <p class="ks-bio__bblock-text">
          Зато мне было очень интересно разбираться в компьютерах:  уроки информатики, игры, первые программы. Я даже
          знал что такое «командная строка», и мог с её помощью запустить игру, что делало меня самым ценным человеком в
          компьютерном классе.
          <br />
          <br />
          Но вот за что я действительно очень благодарен школе, так это за уроки профориентации. Они работали потрясающе
          эффективно, поэтому ещё в школьном возрасте я знал, что хочу работать менеджером, с людьми. Но сразу,
          естественно, ничего не бывает.
        </p>
      </ks-bio-chapter>
    </div>
    <div class="ks-bio__col">
      <ks-bio-chapter title="Молодость" timeline="2000 - 2017 гг.">
        <p class="ks-bio__bblock-text">
          Поступив в университет МГУЭСИ, на специальность «Менеджмент организации, специализации и развития человеческих
          ресурсов», я вспомнил своё увлечение информационными технологиями, поэтому быстро попал в сенат, где занял
          должность человека отвечающего за информационный блок. Организовывал мероприятия, проводил встречи. Однажды
          удалось на Windows NT установить CS 1.6 и устроить турнир среди факультетов.
          <br />
          <br />
          В 1999 году вышли «Герои Меча и Магии 3». Скачать или купить возможности не было, поэтому я попросил у друга
          диск. Друг учился в РГСУ, встретились мы в Сокольниках, а с ним была его подруга. Мы друг другу понравились.
          Она пела в хоре РГСУ, ну, и я туда пошёл петь. С девушкой мы расстались, из хора она ушла. Зато в этом же хоре
          я познакомился со своей будущей женой — Ольгой. Через полгода я сделал ей предложение. Через 5 лет мы сыграли
          свадьбу. В 2010-ом году у нас родилась дочка, в 2013-ом — сын.
          <br />
          <ks-bio-photo img-url="block-2.jpg" alt="Алексей с женой Ольгой" />
          <br />
          <br />
          На первую работу я попал через знакомых, когда ещё учился на специалитете. Мне предложили участвовать в
          съёмках кино. Иногда я был костюмером, иногда отвечал за реквизит. Однажды даже заменял каскадёра. Платили
          $600 в месяц, на те времена это были большие деньги. Итогом этой работы стал фильм, где моя фамилия есть в
          титрах: «Неверность» (2006).
          <br />
          <br />
          Когда заканчивал учёбу в университете меня отправили на практику в ВЗАО "АСЭН". Поскольку с кино не сложилось,
          место преддипломной практики и стало моей работой на следующие 5 лет. В этой компании я занимал должность
          начальника информационно-аналитического отдела, если говорить простыми словами — эникейщика. Следил за работой
          сервера, рассылкой почты, сетевым оборудованием.  Ну, а в свободное время я играл в ButtleField по сетке,
          перепробовал все моды на The Elder Scrolls IV: Oblivion и так далее по списку.
          <br />
          <br />
          Несмотря на то, что вроде бы работа была в большей степени связана с техникой, главное, что я вынес по
          прошествии пяти лет – это умение отстаивать свою точку зрения. В дальнейшем мне это очень сильно пригодилось.
        </p>
      </ks-bio-chapter>
      <ks-bio-photo img-url="block-3.jpg" alt="Хор РГСУ" />
    </div>
    <div class="ks-bio__col">
      <ks-bio-chapter title="Зрелость" timeline="2017 - НАШИ ДНИ">
        <p class="ks-bio__bblock-text">
          В 2017-ом году я участвовал в конкурсе «Молодой преподаватель». Занял призовое место в одной из компетенций.
          Волей случая в зале сидела Назарова Наталья Николаевна, на то время действующий директор Колледжа РГСУ. После
          мероприятия она подошла и предложила встать на её место. Я был очень удивлён, даже немного испуган. Выдержал
          мхатовскую паузу и ответил: «Да».
          <br />
          <br />
          С того момента многое изменилось. Я чувствую ответственность за каждого преподавателя, студента или просто
          работника. Когда я не хочу идти на работу, я не могу себе этого позволить, ни при каких обстоятельствах.
          <br />
          <br />
          Я понял для себя одну истину – работа крупного менеджера не том, чтобы прийти и поменять всё, переделать,
          перестроить, а в том, чтобы поддерживать весь механизм работы. Здесь, в колледже, каждый человек на своём
          месте. Моя задача – обеспечить этому человеку всё для продуктивной и комфортной работы.
        </p>
      </ks-bio-chapter>
      <ks-bio-photo img-url="block-4.jpg" alt="Актовый зал РГСУ" />
    </div>
    <ks-footer />
  </div>
</template>

<script>
import KsHeader from '@/components/ks-header.vue'
import KsHeadingBio from '@/components/biography/ks-heading-bio.vue'
import KsBioChapter from '@/components/biography/ks-bio-chapter.vue'
import KsBioPhoto from '@/components/biography/ks-bio-photo.vue'
import KsFooter from '@/components/ks-footer.vue'

export default {
  components: {
    KsHeader,
    KsHeadingBio,
    KsBioChapter,
    KsBioPhoto,
    KsFooter,
  },
}
</script>

<style>
.ks-bio__col {
  width: 100%;
  padding: 0 160px;
  margin-bottom: 16rem;
}
</style>
